MikroElektronika/core_packages/PIC/XC8/def/PIC18F87J11/mcu.h
extern volatile __bit                   PCFG13              __at(0x7E15);	// @ (0xFC2 * 8 + 5)
#define                                 PCFG13_bit          _BIT_ACCESS(ANCON1,5)
// ANCON1<PCFG14>
extern volatile __bit                   PCFG14              __at(0x7E16);	// @ (0xFC2 * 8 + 6)
#define                                 PCFG14_bit          _BIT_ACCESS(ANCON1,6)
// ANCON1<PCFG15>
extern volatile __bit                   PCFG15              __at(0x7E17);	// @ (0xFC2 * 8 + 7)
#define                                 PCFG15_bit          _BIT_ACCESS(ANCON1,7)
// ANCON0<PCFG2>
extern volatile __bit                   PCFG2               __at(0x7E0A);	// @ (0xFC1 * 8 + 2)
#define                                 PCFG2_bit           _BIT_ACCESS(ANCON0,2)
// ANCON0<PCFG3>
extern volatile __bit                   PCFG3               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 PCFG3_bit           _BIT_ACCESS(ANCON0,3)
// ANCON0<PCFG4>
extern volatile __bit                   PCFG4               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 PCFG4_bit           _BIT_ACCESS(ANCON0,4)
// ANCON0<PCFG5>
extern volatile __bit                   PCFG5               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 PCFG5_bit           _BIT_ACCESS(ANCON0,5)
// ANCON0<PCFG6>
extern volatile __bit                   PCFG6               __at(0x7E0E);	// @ (0xFC1 * 8 + 6)
#define                                 PCFG6_bit           _BIT_ACCESS(ANCON0,6)
// ANCON0<PCFG7>
extern volatile __bit                   PCFG7               __at(0x7E0F);	// @ (0xFC1 * 8 + 7)
#define                                 PCFG7_bit           _BIT_ACCESS(ANCON0,7)
// ANCON1<PCFG8>
extern volatile __bit                   PCFG8               __at(0x7E10);	// @ (0xFC2 * 8 + 0)
#define                                 PCFG8_bit           _BIT_ACCESS(ANCON1,0)
// ANCON1<PCFG9>
extern volatile __bit                   PCFG9               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 PCFG9_bit           _BIT_ACCESS(ANCON1,1)
// RCON<PD>
extern volatile __bit                   PD                  __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 PD_bit              _BIT_ACCESS(RCON,2)
// PORTE<PD2>
extern volatile __bit                   _PD2                 __at(0x7C20);	// @ (0xF84 * 8 + 0)  // Note: Changed by MikroE
#define                                 PD2_bit             _BIT_ACCESS(PORTE,0)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// INTCON<PEIE_GIEL>
extern volatile __bit                   PEIE_GIEL           __at(0x7F96);	// @ (0xFF2 * 8 + 6)
#define                                 PEIE_GIEL_bit       _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit _DEPRECATED       PEN                 __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// SSP1CON2<PEN1>
extern volatile __bit                   PEN1                __at(0x7E2A);	// @ (0xFC5 * 8 + 2)
#define                                 PEN1_bit            _BIT_ACCESS(SSP1CON2,2)
// SSP2CON2<PEN2>
extern volatile __bit                   PEN2                __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 PEN2_bit            _BIT_ACCESS(SSP2CON2,2)
// PORTB<PGC>
extern volatile __bit                   PGC                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 PGC_bit             _BIT_ACCESS(PORTB,6)
// PORTB<PGD>
extern volatile __bit                   PGD                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 PGD_bit             _BIT_ACCESS(PORTB,7)
// OSCTUNE<PLLEN>
extern volatile __bit                   PLLEN               __at(0x7CDE);	// @ (0xF9B * 8 + 6)
#define                                 PLLEN_bit           _BIT_ACCESS(OSCTUNE,6)
// PORTB<PMA0>
extern volatile __bit                   PMA0                __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 PMA0_bit            _BIT_ACCESS(PORTB,5)
// PORTB<PMA1>
extern volatile __bit                   PMA1                __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 PMA1_bit            _BIT_ACCESS(PORTB,4)
// PORTE<PMA10>
extern volatile __bit                   PMA10               __at(0x7C26);	// @ (0xF84 * 8 + 6)
#define                                 PMA10_bit           _BIT_ACCESS(PORTE,6)
// PORTE<PMA11>
extern volatile __bit                   PMA11               __at(0x7C25);	// @ (0xF84 * 8 + 5)
#define                                 PMA11_bit           _BIT_ACCESS(PORTE,5)
// PORTE<PMA12>
extern volatile __bit                   PMA12               __at(0x7C24);	// @ (0xF84 * 8 + 4)
#define                                 PMA12_bit           _BIT_ACCESS(PORTE,4)
// PORTE<PMA13>
extern volatile __bit                   PMA13               __at(0x7C23);	// @ (0xF84 * 8 + 3)
#define                                 PMA13_bit           _BIT_ACCESS(PORTE,3)
// PORTB<PMA2>
extern volatile __bit                   PMA2                __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 PMA2_bit            _BIT_ACCESS(PORTB,3)
// PORTB<PMA3>
extern volatile __bit                   PMA3                __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 PMA3_bit            _BIT_ACCESS(PORTB,2)
// PORTB<PMA4>
extern volatile __bit                   PMA4                __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 PMA4_bit            _BIT_ACCESS(PORTB,1)
// PORTF<PMA5>
extern volatile __bit                   PMA5                __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 PMA5_bit            _BIT_ACCESS(PORTF,2)
// PORTG<PMA6>
extern volatile __bit                   PMA6                __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 PMA6_bit            _BIT_ACCESS(PORTG,2)
// PORTG<PMA7>
extern volatile __bit                   PMA7                __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 PMA7_bit            _BIT_ACCESS(PORTG,1)
// PORTG<PMA8>
extern volatile __bit                   PMA8                __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 PMA8_bit            _BIT_ACCESS(PORTG,0)
// PORTE<PMA9>
extern volatile __bit                   PMA9                __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 PMA9_bit            _BIT_ACCESS(PORTE,7)
// PORTG<PMCS1>
extern volatile __bit                   PMCS1               __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 PMCS1_bit           _BIT_ACCESS(PORTG,3)
// PORTG<PMCS2>
extern volatile __bit                   PMCS2               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 PMCS2_bit           _BIT_ACCESS(PORTG,4)
// PMCONH<PMPEN>
extern volatile __bit                   PMPEN               __at(0x7B2F);	// @ (0xF65 * 8 + 7)
#define                                 PMPEN_bit           _BIT_ACCESS(PMCONH,7)
// PIE1<PMPIE>
extern volatile __bit                   PMPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PMPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PMPIF>
extern volatile __bit                   PMPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PMPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PMPIP>
extern volatile __bit                   PMPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PMPIP_bit           _BIT_ACCESS(IPR1,7)
// PADCFG1<PMPTL>
extern volatile __bit                   PMPTL               __at(0x7E60);	// @ (0xFCC * 8 + 0)
#define                                 PMPTL_bit           _BIT_ACCESS(PADCFG1,0)
// PADCFG1<PMPTTL>
extern volatile __bit                   PMPTTL              __at(0x7E60);	// @ (0xFCC * 8 + 0)
#define                                 PMPTTL_bit          _BIT_ACCESS(PADCFG1,0)
// RCON<POR>
extern volatile __bit                   POR                 __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 POR_bit             _BIT_ACCESS(RCON,1)
// T0CON<PSA>
extern volatile __bit                   PSA                 __at(0x7EAB);	// @ (0xFD5 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(T0CON,3)
// PMCONH<PSIDL>
extern volatile __bit                   PSIDL               __at(0x7B2D);	// @ (0xF65 * 8 + 5)
#define                                 PSIDL_bit           _BIT_ACCESS(PMCONH,5)
// PIE1<PSPIE>
extern volatile __bit                   PSPIE               __at(0x7CEF);	// @ (0xF9D * 8 + 7)
#define                                 PSPIE_bit           _BIT_ACCESS(PIE1,7)
// PIR1<PSPIF>
extern volatile __bit                   PSPIF               __at(0x7CF7);	// @ (0xF9E * 8 + 7)
#define                                 PSPIF_bit           _BIT_ACCESS(PIR1,7)
// IPR1<PSPIP>
extern volatile __bit                   PSPIP               __at(0x7CFF);	// @ (0xF9F * 8 + 7)
#define                                 PSPIP_bit           _BIT_ACCESS(IPR1,7)
// ECCP1AS<PSS1AC0>
extern volatile __bit                   PSS1AC0             __at(0x7DFA);	// @ (0xFBF * 8 + 2)
#define                                 PSS1AC0_bit         _BIT_ACCESS(ECCP1AS,2)
// ECCP1AS<PSS1AC1>
extern volatile __bit                   PSS1AC1             __at(0x7DFB);	// @ (0xFBF * 8 + 3)
#define                                 PSS1AC1_bit         _BIT_ACCESS(ECCP1AS,3)
// ECCP1AS<PSS1BD0>
extern volatile __bit                   PSS1BD0             __at(0x7DF8);	// @ (0xFBF * 8 + 0)
#define                                 PSS1BD0_bit         _BIT_ACCESS(ECCP1AS,0)
// ECCP1AS<PSS1BD1>
extern volatile __bit                   PSS1BD1             __at(0x7DF9);	// @ (0xFBF * 8 + 1)
#define                                 PSS1BD1_bit         _BIT_ACCESS(ECCP1AS,1)
// ECCP2AS<PSS2AC0>
extern volatile __bit                   PSS2AC0             __at(0x7DD2);	// @ (0xFBA * 8 + 2)
#define                                 PSS2AC0_bit         _BIT_ACCESS(ECCP2AS,2)
// ECCP2AS<PSS2AC1>
extern volatile __bit                   PSS2AC1             __at(0x7DD3);	// @ (0xFBA * 8 + 3)
#define                                 PSS2AC1_bit         _BIT_ACCESS(ECCP2AS,3)
// ECCP2AS<PSS2BD0>
extern volatile __bit                   PSS2BD0             __at(0x7DD0);	// @ (0xFBA * 8 + 0)
#define                                 PSS2BD0_bit         _BIT_ACCESS(ECCP2AS,0)
// ECCP2AS<PSS2BD1>
extern volatile __bit                   PSS2BD1             __at(0x7DD1);	// @ (0xFBA * 8 + 1)
#define                                 PSS2BD1_bit         _BIT_ACCESS(ECCP2AS,1)
// ECCP3AS<PSS3AC0>
extern volatile __bit                   PSS3AC0             __at(0x7DAA);	// @ (0xFB5 * 8 + 2)
#define                                 PSS3AC0_bit         _BIT_ACCESS(ECCP3AS,2)
// ECCP3AS<PSS3AC1>
extern volatile __bit                   PSS3AC1             __at(0x7DAB);	// @ (0xFB5 * 8 + 3)
#define                                 PSS3AC1_bit         _BIT_ACCESS(ECCP3AS,3)
// ECCP3AS<PSS3BD0>
extern volatile __bit                   PSS3BD0             __at(0x7DA8);	// @ (0xFB5 * 8 + 0)
#define                                 PSS3BD0_bit         _BIT_ACCESS(ECCP3AS,0)
// ECCP3AS<PSS3BD1>
extern volatile __bit                   PSS3BD1             __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 PSS3BD1_bit         _BIT_ACCESS(ECCP3AS,1)
// PMCONH<PTBEEN>
extern volatile __bit                   PTBEEN              __at(0x7B2A);	// @ (0xF65 * 8 + 2)
#define                                 PTBEEN_bit          _BIT_ACCESS(PMCONH,2)
// PMEL<PTEN0>
extern volatile __bit                   PTEN0               __at(0x7AE0);	// @ (0xF5C * 8 + 0)
#define                                 PTEN0_bit           _BIT_ACCESS(PMEL,0)
// PMEL<PTEN1>
extern volatile __bit                   PTEN1               __at(0x7AE1);	// @ (0xF5C * 8 + 1)
#define                                 PTEN1_bit           _BIT_ACCESS(PMEL,1)
// PMEH<PTEN10>
extern volatile __bit                   PTEN10              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 PTEN10_bit          _BIT_ACCESS(PMEH,2)
// PMEH<PTEN11>
extern volatile __bit                   PTEN11              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 PTEN11_bit          _BIT_ACCESS(PMEH,3)
// PMEH<PTEN12>
extern volatile __bit                   PTEN12              __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 PTEN12_bit          _BIT_ACCESS(PMEH,4)
// PMEH<PTEN13>
extern volatile __bit                   PTEN13              __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 PTEN13_bit          _BIT_ACCESS(PMEH,5)
// PMEH<PTEN14>
extern volatile __bit                   PTEN14              __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 PTEN14_bit          _BIT_ACCESS(PMEH,6)
// PMEH<PTEN15>
extern volatile __bit                   PTEN15              __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 PTEN15_bit          _BIT_ACCESS(PMEH,7)
// PMEL<PTEN2>
extern volatile __bit                   PTEN2               __at(0x7AE2);	// @ (0xF5C * 8 + 2)
#define                                 PTEN2_bit           _BIT_ACCESS(PMEL,2)
// PMEL<PTEN3>
extern volatile __bit                   PTEN3               __at(0x7AE3);	// @ (0xF5C * 8 + 3)
#define                                 PTEN3_bit           _BIT_ACCESS(PMEL,3)
// PMEL<PTEN4>
extern volatile __bit                   PTEN4               __at(0x7AE4);	// @ (0xF5C * 8 + 4)
#define                                 PTEN4_bit           _BIT_ACCESS(PMEL,4)
// PMEL<PTEN5>
extern volatile __bit                   PTEN5               __at(0x7AE5);	// @ (0xF5C * 8 + 5)
#define                                 PTEN5_bit           _BIT_ACCESS(PMEL,5)
// PMEL<PTEN6>
extern volatile __bit                   PTEN6               __at(0x7AE6);	// @ (0xF5C * 8 + 6)
#define                                 PTEN6_bit           _BIT_ACCESS(PMEL,6)
// PMEL<PTEN7>
extern volatile __bit                   PTEN7               __at(0x7AE7);	// @ (0xF5C * 8 + 7)
#define                                 PTEN7_bit           _BIT_ACCESS(PMEL,7)
// PMEH<PTEN8>
extern volatile __bit                   PTEN8               __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 PTEN8_bit           _BIT_ACCESS(PMEH,0)
// PMEH<PTEN9>
extern volatile __bit                   PTEN9               __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 PTEN9_bit           _BIT_ACCESS(PMEH,1)
// PMCONH<PTRDEN>
extern volatile __bit                   PTRDEN              __at(0x7B28);	// @ (0xF65 * 8 + 0)
#define                                 PTRDEN_bit          _BIT_ACCESS(PMCONH,0)
// PMCONH<PTWREN>
extern volatile __bit                   PTWREN              __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 PTWREN_bit          _BIT_ACCESS(PMCONH,1)
// PORTA<RA0>
extern volatile __bit _DEPRECATED       RA0                 __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit _DEPRECATED       RA1                 __at(0x7C01);	// @ (0xF80 * 8 + 1)
#define                                 RA1_bit             _BIT_ACCESS(PORTA,1)
// PORTA<RA2>
extern volatile __bit _DEPRECATED       RA2                 __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 RA2_bit             _BIT_ACCESS(PORTA,2)
// PORTA<RA3>
extern volatile __bit _DEPRECATED       RA3                 __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 RA3_bit             _BIT_ACCESS(PORTA,3)
// PORTA<RA4>
extern volatile __bit _DEPRECATED       RA4                 __at(0x7C04);	// @ (0xF80 * 8 + 4)
#define                                 RA4_bit             _BIT_ACCESS(PORTA,4)
// PORTA<RA5>
extern volatile __bit _DEPRECATED       RA5                 __at(0x7C05);	// @ (0xF80 * 8 + 5)
#define                                 RA5_bit             _BIT_ACCESS(PORTA,5)
// PORTA<RA6>
extern volatile __bit _DEPRECATED       RA6                 __at(0x7C06);	// @ (0xF80 * 8 + 6)
#define                                 RA6_bit             _BIT_ACCESS(PORTA,6)
// PORTA<RA7>
extern volatile __bit _DEPRECATED       RA7                 __at(0x7C07);	// @ (0xF80 * 8 + 7)
#define                                 RA7_bit             _BIT_ACCESS(PORTA,7)
// PORTB<RB0>
extern volatile __bit _DEPRECATED       RB0                 __at(0x7C08);	// @ (0xF81 * 8 + 0)
#define                                 RB0_bit             _BIT_ACCESS(PORTB,0)
// PORTB<RB1>
extern volatile __bit _DEPRECATED       RB1                 __at(0x7C09);	// @ (0xF81 * 8 + 1)
#define                                 RB1_bit             _BIT_ACCESS(PORTB,1)
// PORTB<RB2>
extern volatile __bit _DEPRECATED       RB2                 __at(0x7C0A);	// @ (0xF81 * 8 + 2)
#define                                 RB2_bit             _BIT_ACCESS(PORTB,2)
// PORTB<RB3>
extern volatile __bit _DEPRECATED       RB3                 __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 RB3_bit             _BIT_ACCESS(PORTB,3)
// PORTB<RB4>
extern volatile __bit _DEPRECATED       RB4                 __at(0x7C0C);	// @ (0xF81 * 8 + 4)
#define                                 RB4_bit             _BIT_ACCESS(PORTB,4)
// PORTB<RB5>
extern volatile __bit _DEPRECATED       RB5                 __at(0x7C0D);	// @ (0xF81 * 8 + 5)
#define                                 RB5_bit             _BIT_ACCESS(PORTB,5)
// PORTB<RB6>
extern volatile __bit _DEPRECATED       RB6                 __at(0x7C0E);	// @ (0xF81 * 8 + 6)
#define                                 RB6_bit             _BIT_ACCESS(PORTB,6)
// PORTB<RB7>
extern volatile __bit _DEPRECATED       RB7                 __at(0x7C0F);	// @ (0xF81 * 8 + 7)
#define                                 RB7_bit             _BIT_ACCESS(PORTB,7)
// INTCON<RBIE>
extern volatile __bit                   RBIE                __at(0x7F93);	// @ (0xFF2 * 8 + 3)
#define                                 RBIE_bit            _BIT_ACCESS(INTCON,3)
// INTCON<RBIF>
extern volatile __bit                   RBIF                __at(0x7F90);	// @ (0xFF2 * 8 + 0)
#define                                 RBIF_bit            _BIT_ACCESS(INTCON,0)
// INTCON2<RBIP>
extern volatile __bit                   RBIP                __at(0x7F88);	// @ (0xFF1 * 8 + 0)
#define                                 RBIP_bit            _BIT_ACCESS(INTCON2,0)
// INTCON2<RBPU>
extern volatile __bit                   RBPU                __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 RBPU_bit            _BIT_ACCESS(INTCON2,7)
// PORTC<RC0>
extern volatile __bit _DEPRECATED       RC0                 __at(0x7C10);	// @ (0xF82 * 8 + 0)
#define                                 RC0_bit             _BIT_ACCESS(PORTC,0)
// PORTC<RC1>
extern volatile __bit _DEPRECATED       RC1                 __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 RC1_bit             _BIT_ACCESS(PORTC,1)
// PIE1<RC1IE>
extern volatile __bit                   RC1IE               __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RC1IE_bit           _BIT_ACCESS(PIE1,5)
// PIR1<RC1IF>
extern volatile __bit                   RC1IF               __at(0x7CF5);	// @ (0xF9E * 8 + 5)
#define                                 RC1IF_bit           _BIT_ACCESS(PIR1,5)
// IPR1<RC1IP>
extern volatile __bit                   RC1IP               __at(0x7CFD);	// @ (0xF9F * 8 + 5)
#define                                 RC1IP_bit           _BIT_ACCESS(IPR1,5)
// PORTC<RC2>
extern volatile __bit _DEPRECATED       RC2                 __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 RC2_bit             _BIT_ACCESS(PORTC,2)
// PIE3<RC2IE>
extern volatile __bit                   RC2IE               __at(0x7D1D);	// @ (0xFA3 * 8 + 5)
#define                                 RC2IE_bit           _BIT_ACCESS(PIE3,5)
// PIR3<RC2IF>
extern volatile __bit                   RC2IF               __at(0x7D25);	// @ (0xFA4 * 8 + 5)
#define                                 RC2IF_bit           _BIT_ACCESS(PIR3,5)
// IPR3<RC2IP>
extern volatile __bit                   RC2IP               __at(0x7D2D);	// @ (0xFA5 * 8 + 5)
#define                                 RC2IP_bit           _BIT_ACCESS(IPR3,5)
// PORTC<RC3>
extern volatile __bit _DEPRECATED       RC3                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 RC3_bit             _BIT_ACCESS(PORTC,3)
// PORTC<RC4>
extern volatile __bit _DEPRECATED       RC4                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 RC4_bit             _BIT_ACCESS(PORTC,4)
// PORTC<RC5>
extern volatile __bit _DEPRECATED       RC5                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 RC5_bit             _BIT_ACCESS(PORTC,5)
// PORTC<RC6>
extern volatile __bit _DEPRECATED       RC6                 __at(0x7C16);	// @ (0xF82 * 8 + 6)
#define                                 RC6_bit             _BIT_ACCESS(PORTC,6)
// PORTC<RC7>
extern volatile __bit _DEPRECATED       RC7                 __at(0x7C17);	// @ (0xF82 * 8 + 7)
#define                                 RC7_bit             _BIT_ACCESS(PORTC,7)
// RCSTA2<RC8_92>
extern volatile __bit                   RC8_92              __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC8_92_bit          _BIT_ACCESS(RCSTA2,6)
// RCSTA2<RC92>
extern volatile __bit                   RC92                __at(0x7CE6);	// @ (0xF9C * 8 + 6)
#define                                 RC92_bit            _BIT_ACCESS(RCSTA2,6)
// RCSTA2<RCD82>
extern volatile __bit                   RCD82               __at(0x7CE0);	// @ (0xF9C * 8 + 0)
#define                                 RCD82_bit           _BIT_ACCESS(RCSTA2,0)
// SSP1CON2<RCEN>
extern volatile __bit _DEPRECATED       RCEN                __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN_bit            _BIT_ACCESS(SSP1CON2,3)
// SSP1CON2<RCEN1>
extern volatile __bit                   RCEN1               __at(0x7E2B);	// @ (0xFC5 * 8 + 3)
#define                                 RCEN1_bit           _BIT_ACCESS(SSP1CON2,3)
// SSP2CON2<RCEN2>
extern volatile __bit                   RCEN2               __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 RCEN2_bit           _BIT_ACCESS(SSP2CON2,3)
// BAUDCON1<RCIDL>
extern volatile __bit _DEPRECATED       RCIDL               __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL_bit           _BIT_ACCESS(BAUDCON1,6)
// BAUDCON1<RCIDL1>
extern volatile __bit                   RCIDL1              __at(0x7BF6);	// @ (0xF7E * 8 + 6)
#define                                 RCIDL1_bit          _BIT_ACCESS(BAUDCON1,6)
// BAUDCON2<RCIDL2>
extern volatile __bit                   RCIDL2              __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 RCIDL2_bit          _BIT_ACCESS(BAUDCON2,6)
// PIE1<RCIE>
extern volatile __bit                   RCIE                __at(0x7CED);	// @ (0xF9D * 8 + 5)
#define                                 RCIE_bit            _BIT_ACCESS(PIE1,5)
// PIR1<RCIF>
extern volatile __bit                   RCIF                __at(0x7CF5);	// @ (0xF9E * 8 + 5)
